# Libraries

In [1]:
import pandas as pd

# Load data

In [2]:
df = pd.read_csv("topyoutube.csv")

In [3]:
df.head()

          Artist Total Views  100M     Avg
0            BTS    27,947.9  63.0   7.370
1      Bad Bunny    27,573.4  66.0  14.555
2  Justin Bieber    27,399.7  37.0   3.986
3     Ed Sheeran    26,894.0  39.0   4.609
4   Taylor Swift    24,350.0  38.0   5.716

In [4]:
df.dtypes

Artist          object
Total Views     object
100M           float64
Avg            float64
dtype: object

In [5]:
df.shape

(1587, 4)

# Data preparation

## Complete null values

In [6]:
# Empty values per column
df.isna().sum()

Artist           0
Total Views      0
100M           171
Avg              0
dtype: int64

In [8]:
df["100M"].fillna(0, inplace=True)

## Multiply column  100M per 100.000.000

In [11]:
df["100M"] = df["100M"] * 100_000_000

## Format “AVG” column to 2 decimal places after comma

In [17]:
df["Avg"] = round(df["Avg"], 2)

# Data analysis

## Top 10 users

In [20]:
df.head(10)

          Artist Total Views          100M    Avg
0            BTS    27,947.9  6.300000e+09   7.37
1      Bad Bunny    27,573.4  6.600000e+09  14.56
2  Justin Bieber    27,399.7  3.700000e+09   3.99
3     Ed Sheeran    26,894.0  3.900000e+09   4.61
4   Taylor Swift    24,350.0  3.800000e+09   5.72
5        Shakira    23,961.8  4.300000e+09   7.84
6     Katy Perry    23,553.4  2.500000e+09   3.18
7          Ozuna    22,524.8  4.900000e+09   4.93
8         Eminem    20,937.7  3.800000e+09   5.84
9  Ariana Grande    20,618.5  3.700000e+09   3.37

## First 100 users by name descending

In [23]:
df_filter_by_name = \
df.sort_values(by=['Artist'], ascending=False, ignore_index=True)

In [35]:
df_filter_by_name.iloc[0:100]

           Artist Total Views         100M   Avg
0          Łobuzy       396.5  200000000.0  0.11
1     İrem Derici     1,717.3  300000000.0  0.32
2      Ñengo Flow     1,388.8  400000000.0  0.82
3   Çağatay Akman       742.7  200000000.0  0.05
4       will.i.am     2,582.0  600000000.0  0.30
..            ...         ...          ...   ...
95     Via Vallen     1,787.5  300000000.0  0.08
96   Veysel Mutlu       277.4  100000000.0  0.03
97         Veysel       412.2          0.0  0.06
98      Vengaboys       934.8  300000000.0  0.34
99      Vegedream       991.3  100000000.0  0.51

[100 rows x 4 columns]

# Save clean data

In [38]:
df.to_csv("topyoutube_clean", index=False)